# ETL Data Warehouse - Furacão e Aquecimento Global

**Integrantes:**
* Daniel Carvalho Dantas
* Gabriel Freitas Ximenes de Vasconcelos - 11819084
* Marcus Huziwara
* Raíssa Torres Barreira

In [124]:
!pip install reverse_geocode
!pip install geopandas shapely
!pip install pycountry_convert

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: reverse_geocode in /home/kibon/.local/lib/python3.10/site-packages (1.4.1)
Requirement already satisfied: scipy in /home/kibon/.local/lib/python3.10/site-packages (from reverse_geocode) (1.11.3)
Requirement already satisfied: numpy in /home/kibon/.local/lib/python3.10/site-packages (from reverse_geocode) (1.24.2)

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: geopandas in /home/kibon/.local/lib/python3.10/site-packages (0.14.1)
Requirement already satisfied: shapely in /home/kibon/.local/lib/python3.10/site-packages (2.0.2)
Requirement already satisfied: fiona>=1.8.21 in /home/kibon/.local/lib/python3.10/site-packages (from geopandas) (1.9.5)
Requirement already satisfied: pandas>=1.4.0 in /home/kibon/.local/lib/python3.10/site-packages (from geopandas) (2.1.1)
Requirement already satisfied: pyproj>=3.3.0 in /home/kibon/.local/lib/python3.10/site-packages (from geopandas) (3.6.1)
Requirement already satisfied: packaging in /home/kibon/.local/lib/python3.10/site-packages (from geopandas) (23.0)
Requirement already satisfied: numpy>=1.14 in /home/kibon/.local/lib/python3.10/site-packages (from shapely) (1.24.2)
Requirement already satisfied: click-plugins>=1.0 in /home/kibon/.local/lib/python3.10/site-packages (from fiona>=1.8.21->geopandas) (1.1.1)
Requirement already satisfied: six in /usr/lib/python3/dist-packages (from fiona>=1.8.21->geopandas) (1.16.0)
Requirement already satisfied: cligj>=0.5 in /home/kibon/.local/lib/python3.10/site-packages (from fiona>=1.8.21->geopandas) (0.7.2)
Requirement already satisfied: attrs>=19.2.0 in /home/kibon/.local/lib/python3.10/site-packages (from fiona>=1.8.21->geopandas) (22.2.0)
Requirement already satisfied: certifi in /home/kibon/.local/lib/python3.10/site-packages (from fiona>=1.8.21->geopandas) (2022.12.7)
Requirement already satisfied: click~=8.0 in /usr/lib/python3/dist-packages (from fiona>=1.8.21->geopandas) (8.0.3)
Requirement already satisfied: setuptools in /home/kibon/.local/lib/python3.10/site-packages (from fiona>=1.8.21->geopandas) (68.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/kibon/.local/lib/python3.10/site-packages (from pandas>=1.4.0->geopandas) (2.8.2)
Requirement already satisfied: tzdata>=2022.1 in /home/kibon/.local/lib/python3.10/site-packages (from pandas>=1.4.0->geopandas) (2023.3)
Requirement already satisfied: pytz>=2020.1 in /usr/lib/python3/dist-packages (from pandas>=1.4.0->geopandas) (2022.1)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pycountry_convert in /home/kibon/.local/lib/python3.10/site-packages (0.7.2)
Requirement already satisfied: pprintpp>=0.3.0 in /home/kibon/.local/lib/python3.10/site-packages (from pycountry_convert) (0.4.0)
Requirement already satisfied: wheel>=0.30.0 in /usr/lib/python3/dist-packages (from pycountry_convert) (0.37.1)
Requirement already satisfied: pytest>=3.4.0 in /home/kibon/.local/lib/python3.10/site-packages (from pycountry_convert) (7.4.3)
Requirement already satisfied: pycountry>=16.11.27.1 in /home/kibon/.local/lib/python3.10/site-packages (from pycountry_convert) (22.3.5)
Requirement already satisfied: pytest-mock>=1.6.3 in /home/kibon/.local/lib/python3.10/site-packages (from pycountry_convert) (3.12.0)
Requirement already satisfied: pytest-cov>=2.5.1 in /home/kibon/.local/lib/python3.10/site-packages (from pycountry_convert) (4.1.0)
Requirement already satisfied: repoze.lru>=0.7 in /home/kibon/.local/lib/python3.10/site-packages (from pycountry_convert) (0.7)
Requirement already satisfied: setuptools in /home/kibon/.local/lib/python3.10/site-packages (from pycountry>=16.11.27.1->pycountry_convert) (68.2.2)
Requirement already satisfied: iniconfig in /home/kibon/.local/lib/python3.10/site-packages (from pytest>=3.4.0->pycountry_convert) (2.0.0)
Requirement already satisfied: tomli>=1.0.0 in /home/kibon/.local/lib/python3.10/site-packages (from pytest>=3.4.0->pycountry_convert) (2.0.1)
Requirement already satisfied: exceptiongroup>=1.0.0rc8 in /home/kibon/.local/lib/python3.10/site-packages (from pytest>=3.4.0->pycountry_convert) (1.1.1)
Requirement already satisfied: pluggy<2.0,>=0.12 in /home/kibon/.local/lib/python3.10/site-packages (from pytest>=3.4.0->pycountry_convert) (1.3.0)
Requirement already satisfied: packaging in /home/kibon/.local/lib/python3.10/site-packages (from pytest>=3.4.0->pycountry_convert) (23.0)
Requirement already satisfied: coverage[toml]>=5.2.1 in /home/kibon/.local/lib/python3.10/site-packages (from pytest-cov>=2.5.1->pycountry_convert) (7.3.2)

In [1]:
import pandas.io.sql as psql
from ipywidgets import interact  ##-- Interactors
import ipywidgets as widgets     #---
from sqlalchemy import create_engine, text
import pandas as pd
import pycountry_convert as pc
import csv
import functools

############## Conectar com um servidor SQL na Base postgres ###################### --> Postgres.postgres
%reload_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:dwightDW@localhost:5455/furacaoDW')
%sql postgresql://postgres:dwightDW@localhost:5455/furacaoDW
%sql SET client_encoding = 'latin1'

%sql DB << SELECT Current_Database();
print(DB)

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
 * postgresql://postgres:***@localhost:5455/furacaoDW
1 rows affected.
Returning data to local variable DB
+------------------+
| current_database |
+------------------+
|    furacaoDW     |
+------------------+

In [162]:
import os

def capture_command_output(command):
    stream = os.popen(command)
    output = stream.read().strip()
    return output

In [163]:
CONTAINER_ID=capture_command_output('sudo -S docker ps -aqf "name=postgresDW" < ./passwordfile')

[sudo] password for kibon:

# Extract

### Furacão
Lemos o csv do furacão do atlântico e do pacífico e adicionamos os dois na tabela HURRICANE_RAW.

In [164]:
capture_command_output(f'sudo -S docker cp hurricane/ {CONTAINER_ID}:hurricane/ < ./passwordfile')

[sudo] password for kibon:

''

In [165]:
hur_a = pd.read_csv("hurricane/atlantic.csv")
hur_p = pd.read_csv("hurricane/pacific.csv")
hur_a.head()

,ID,Name,Date,Time,Event,Status,Latitude,Longitude,Maximum Wind,Minimum Pressure,...,Low Wind SW,Low Wind NW,Moderate Wind NE,Moderate Wind SE,Moderate Wind SW,Moderate Wind NW,High Wind NE,High Wind SE,High Wind SW,High Wind NW
0,AL011851,UNNAMED,18510625,0,,HU,28.0N,94.8W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
1,AL011851,UNNAMED,18510625,600,,HU,28.0N,95.4W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
2,AL011851,UNNAMED,18510625,1200,,HU,28.0N,96.0W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
3,AL011851,UNNAMED,18510625,1800,,HU,28.1N,96.5W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
4,AL011851,UNNAMED,18510625,2100,L,HU,28.2N,96.8W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999

In [130]:
hur_p.head()

,ID,Name,Date,Time,Event,Status,Latitude,Longitude,Maximum Wind,Minimum Pressure,...,Low Wind SW,Low Wind NW,Moderate Wind NE,Moderate Wind SE,Moderate Wind SW,Moderate Wind NW,High Wind NE,High Wind SE,High Wind SW,High Wind NW
0,EP011949,UNNAMED,19490611,0,,TS,20.2N,106.3W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
1,EP011949,UNNAMED,19490611,600,,TS,20.2N,106.4W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
2,EP011949,UNNAMED,19490611,1200,,TS,20.2N,106.7W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
3,EP011949,UNNAMED,19490611,1800,,TS,20.3N,107.7W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
4,EP011949,UNNAMED,19490612,0,,TS,20.4N,108.6W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999

In [131]:
hur_p.columns

Index(['ID', 'Name', 'Date', 'Time', 'Event', 'Status', 'Latitude',
       'Longitude', 'Maximum Wind', 'Minimum Pressure', 'Low Wind NE',
       'Low Wind SE', 'Low Wind SW', 'Low Wind NW', 'Moderate Wind NE',
       'Moderate Wind SE', 'Moderate Wind SW', 'Moderate Wind NW',
       'High Wind NE', 'High Wind SE', 'High Wind SW', 'High Wind NW'],
      dtype='object')

In [166]:
%%sql
DROP TABLE IF EXISTS HURRICANE_RAW;
CREATE TABLE HURRICANE_RAW (
    KEY SERIAL PRIMARY KEY,
    ID VARCHAR(100),
    NAME VARCHAR(200),
    DATE VARCHAR(50),
    TIME VARCHAR(4),
    EVENT VARCHAR(4),
    STATUS VARCHAR(10),
    LATITUDE VARCHAR(15),
    LONGITUDE VARCHAR(15),
    MAXWIND INTEGER,
    MINPRESSURE INTEGER,
    LOWWIND_NE INTEGER,
    LOWWIND_SE INTEGER,
    LOWWIND_NW INTEGER,
    LOWWIND_SW INTEGER,
    MODWIND_NE INTEGER,
    MODWIND_SE INTEGER,
    MODWIND_NW INTEGER,
    MODWIND_SW INTEGER,
    HIGHWIND_NE INTEGER,
    HIGHWIND_SE INTEGER,
    HIGHWIND_NW INTEGER,
    HIGHWIND_SW INTEGER
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

In [167]:
%%sql
COPY HURRICANE_RAW( id, name, date, time, event, status, latitude, longitude,
                maxwind, minpressure, lowwind_ne, lowwind_se, lowwind_nw, lowwind_sw,
                modwind_ne, modwind_se, modwind_nw, modwind_sw,
                highwind_ne, highwind_se, highwind_nw, highwind_sw)
FROM '/hurricane/atlantic.csv'
DELIMITER ','
CSV HEADER;

COPY HURRICANE_RAW( id, name, date, time, event, status, latitude, longitude,
                maxwind, minpressure, lowwind_ne, lowwind_se, lowwind_nw, lowwind_sw,
                modwind_ne, modwind_se, modwind_nw, modwind_sw,
                highwind_ne, highwind_se, highwind_nw, highwind_sw)
FROM '/hurricane/pacific.csv'
DELIMITER ','
CSV HEADER;

 * postgresql://postgres:***@localhost:5455/furacaoDW
49105 rows affected.
26137 rows affected.

[]

### Temperatura
Lemos o csv do aquecimento global e adicionamos os dois na tabela TEMPERATURE_RAW.

In [168]:
capture_command_output(f'sudo -S docker cp temperature/ {CONTAINER_ID}:temperature/  < ./passwordfile')

[sudo] password for kibon:

''

In [169]:
temp = pd.read_csv("temperature/Environment_Temperature_change_E_All_Data_NOFLAG.csv", encoding='latin-1')
temp.head()

,Area Code,Area,Months Code,Months,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2010,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019
0,2,Afghanistan,7001,January,7271,Temperature change,°C,0.777,0.062,2.744,...,3.601,1.179,-0.583,1.233,1.755,1.943,3.416,1.201,1.996,2.951
1,2,Afghanistan,7001,January,6078,Standard Deviation,°C,1.950,1.950,1.950,...,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950
2,2,Afghanistan,7002,February,7271,Temperature change,°C,-1.743,2.465,3.919,...,1.212,0.321,-3.201,1.494,-3.187,2.699,2.251,-0.323,2.705,0.086
3,2,Afghanistan,7002,February,6078,Standard Deviation,°C,2.597,2.597,2.597,...,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597
4,2,Afghanistan,7003,March,7271,Temperature change,°C,0.516,1.336,0.403,...,3.390,0.748,-0.527,2.246,-0.076,-0.497,2.296,0.834,4.418,0.234

In [170]:
def apply_lao(x):
    if x == "Lao People's Democratic Republic":
        return 'Lao Peoples Democratic Republic'
    return x

temp['Area'] = temp['Area'].apply(apply_lao)

In [171]:
temp.to_csv("temperature.csv", index=False)
capture_command_output(f'sudo -S docker cp temperature.csv {CONTAINER_ID}:temperature.csv < ./passwordfile')

[sudo] password for kibon:

''

In [172]:
%%sql
DROP TABLE IF EXISTS TEMPERATURE_RAW;
CREATE TABLE TEMPERATURE_RAW (
    KEY SERIAL PRIMARY KEY,
    AREA_CODE INTEGER,
    AREA VARCHAR(100),
    MONTHS_CODE INTEGER,
    MONTHS VARCHAR(50),
    ELEMENT_CODE INTEGER,
    ELEMENT VARCHAR(100),
    UNIT VARCHAR(10),
    Y1961 REAL, Y1962 REAL,Y1963 REAL,Y1964 REAL,
    Y1965 REAL,Y1966 REAL,Y1967 REAL,Y1968 REAL,
    Y1969 REAL,Y1970 REAL,Y1971 REAL,Y1972 REAL,
    Y1973 REAL,Y1974 REAL,Y1975 REAL,Y1976 REAL,
    Y1977 REAL,Y1978 REAL,Y1979 REAL,Y1980 REAL,
    Y1981 REAL,Y1982 REAL,Y1983 REAL,Y1984 REAL,
    Y1985 REAL,Y1986 REAL,Y1987 REAL,Y1988 REAL,
    Y1989 REAL,Y1990 REAL,Y1991 REAL,Y1992 REAL,
    Y1993 REAL,Y1994 REAL,Y1995 REAL,Y1996 REAL,
    Y1997 REAL,Y1998 REAL,Y1999 REAL,Y2000 REAL,
    Y2001 REAL,Y2002 REAL,Y2003 REAL,Y2004 REAL,
    Y2005 REAL,Y2006 REAL,Y2007 REAL,Y2008 REAL,
    Y2009 REAL,Y2010 REAL,Y2011 REAL,Y2012 REAL,
    Y2013 REAL,Y2014 REAL,Y2015 REAL,Y2016 REAL,
    Y2017 REAL,Y2018 REAL,Y2019 REAL
)

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

In [173]:
%%sql
COPY TEMPERATURE_RAW 
    (AREA_CODE, AREA, MONTHS_CODE, MONTHS, ELEMENT_CODE, ELEMENT, UNIT,
    Y1961, Y1962, Y1963, Y1964, Y1965, Y1966, Y1967, Y1968, Y1969, Y1970,
    Y1971, Y1972, Y1973, Y1974, Y1975, Y1976, Y1977, Y1978, Y1979, Y1980, 
    Y1981, Y1982, Y1983, Y1984, Y1985, Y1986, Y1987, Y1988, Y1989, Y1990, 
    Y1991, Y1992, Y1993, Y1994, Y1995, Y1996, Y1997, Y1998, Y1999, Y2000, 
    Y2001, Y2002, Y2003, Y2004, Y2005, Y2006, Y2007, Y2008, Y2009, Y2010, 
    Y2011, Y2012, Y2013, Y2014, Y2015, Y2016, Y2017, Y2018, Y2019)
FROM '/temperature.csv'
DELIMITER ','
CSV HEADER;

 * postgresql://postgres:***@localhost:5455/furacaoDW
9656 rows affected.

[]

### Países
Lemos o csv de países e adicionamos na tabela COUNTRIES. Esses dados foram necessários para a parte geográfica do projeto.

In [174]:
%%sql
SELECT COUNT(DISTINCT(Unit)) FROM TEMPERATURE_RAW;

ALTER TABLE TEMPERATURE_RAW DROP COLUMN Unit;

 * postgresql://postgres:***@localhost:5455/furacaoDW
1 rows affected.
Done.

[]

In [175]:
%%sql
DROP TABLE IF EXISTS COUNTRIES;
CREATE TABLE COUNTRIES (
    ID INTEGER,
    COUNTRY VARCHAR(200)
);
COPY COUNTRIES (id, country)
FROM '/countries.csv'
DELIMITER ','
CSV HEADER;

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.
241 rows affected.

[]

# Transform

## Hurricane

### Alterar o formato da Latitude e Longitude
Nos dados, a latitude e longitude são identificadas como norte, sul, les e oeste pelas letras 'N', 'S', 'E' e 'w'. Para utilizarmos esse valores para calcular a localização do furacão, transformamos apenas em números por meio do cast.

In [176]:
%%sql
UPDATE HURRICANE_RAW
SET LATITUDE = CASE
                      WHEN RIGHT(LATITUDE, 1) = 'N' THEN CAST(SUBSTR(LATITUDE,1, LENGTH(LATITUDE) - 1) AS DECIMAL)
                      WHEN RIGHT(LATITUDE, 1) = 'S' THEN -1 * CAST(SUBSTR(LATITUDE,1, LENGTH(LATITUDE) - 1) AS DECIMAL)
                   END;
UPDATE HURRICANE_RAW
SET LONGITUDE = CASE 
                      wHEN RIGHT(LONGITUDE, 1) = 'E' THEN CAST(SUBSTR(LONGITUDE,1, LENGTH(LONGITUDE) - 1) AS DECIMAL)
                      WHEN RIGHT(LONGITUDE, 1) = 'W' THEN -1 * CAST(SUBSTR(LONGITUDE,1, LENGTH(LONGITUDE) - 1) AS DECIMAL)
                   END;

 * postgresql://postgres:***@localhost:5455/furacaoDW
75242 rows affected.

75242 rows affected.

[]

### Mudar data do HURRICANE_RAW de string para date
Alteramos o formato da coluna data para facilitar na consulta

In [177]:
%%sql
ALTER TABLE HURRICANE_RAW
ALTER COLUMN date TYPE DATE
USING date::Date

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.

[]

### Adicionar mês escrito
De acordo com nossa constelação de fatos, criamos o campo mês escrito. Para isso, criamos uma tabela MONTHS e a preenchemos a partir do csv com todos os meses do ano. Depois, adicionamos a columa mês escrito na tabela HURRICANE_RAW

In [178]:
%%sql
SELECT * FROM HURRICANE_RAW LIMIT 1;

 * postgresql://postgres:***@localhost:5455/furacaoDW
1 rows affected.

[(213, 'AL051852', '            UNNAMED', datetime.date(1852, 10, 7), '600', '  ', ' HU', '18.2', '-81.5', 90, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999)]

In [179]:
capture_command_output(f'sudo -S docker cp months.csv {CONTAINER_ID}:months.csv  < ./passwordfile')

[sudo] password for kibon:

''

In [180]:
%%sql
DROP TABLE IF EXISTS MONTHS;
CREATE TABLE MONTHS (
    Value INTEGER,
    Month VARCHAR(50)
);

COPY MONTHS(Value, Month)
FROM '/months.csv'
DELIMITER ','
CSV HEADER;

ALTER TABLE HURRICANE_RAW
ADD COLUMN WRITTEN_MONTH VARCHAR(50);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.
12 rows affected.
Done.

[]

In [181]:
%%sql
UPDATE HURRICANE_RAW h
SET written_month = m.month
FROM MONTHS m
WHERE EXTRACT(MONTH FROM date) = m.value;

 * postgresql://postgres:***@localhost:5455/furacaoDW

75242 rows affected.

[]

### Mudar time do HURRICANE_RAW de string para time
Alteramos o formato da coluna time para facilitar na consulta

In [182]:
%%sql
UPDATE HURRICANE_RAW
SET time = LPAD(time, 4, '0');

ALTER TABLE HURRICANE_RAW
ALTER COLUMN time TYPE TIME
USING time::TIME;

 * postgresql://postgres:***@localhost:5455/furacaoDW
75242 rows affected.
Done.

[]

### Adicionar países aos furacões
Como só temos a latitude e longitude para localizar um furacão, adicionamos os países em que cada furacão ocorreu, de forma que será mais fácil de comparar na hora de realizar as consultas.

Para isso, usamos a biblioteca reverse_geocode para encontrar os países a partir da latitude e longitude. Criamos uma nova tabela SET_COUNTRY e a preenchemos usando um csv com os países e suas respectivas chaves, de forma que fizemos um inner join entre essa tabela e a HURRICANE_RAW, adicionando os países.

In [183]:
import reverse_geocode

# Encontra os países
def country_finder(coordinate_tuples):
    countries = []
    
    for coord_tuple in coordinate_tuples:
        coordinates = [[coord_tuple[1], coord_tuple[2]]]
        data = reverse_geocode.search(coordinates)
        country = data[0]['country']
        countries.append((coord_tuple[0], country))
    
    return countries

In [184]:
%%sql
lat_long <<
SELECT key, latitude, longitude FROM
HURRICANE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaoDW

75242 rows affected.
Returning data to local variable lat_long

In [185]:
lat_long = [(el[0], float(el[1]), float(el[2])) for el in lat_long]

In [186]:
countries = country_finder(lat_long)
for i in range(len(countries)):
    countries[i] = (countries[i][0], countries[i][1].replace(',', ''))

In [187]:
%%sql
DROP TABLE IF EXISTS SET_COUNTRY;
CREATE TABLE SET_COUNTRY (
    KEY INTEGER,
    COUNTRY VARCHAR(300)
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

In [188]:
with open('set_country.csv', 'a', newline='') as file:
    writer = csv.writer(file)
    writer.writerows(countries)

capture_command_output(f'sudo -S docker cp set_country.csv {CONTAINER_ID}:set_country.csv  < ./passwordfile')

[sudo] password for kibon:

''

In [189]:
%%sql
COPY SET_COUNTRY(key, country)
FROM '/set_country.csv'
DELIMITER ',';

ALTER TABLE HURRICANE_RAW 
ADD COLUMN COUNTRY VARCHAR(255);

 * postgresql://postgres:***@localhost:5455/furacaoDW
3009680 rows affected.
Done.

[]

In [190]:
%%sql
UPDATE HURRICANE_RAW h
SET country = c.country
FROM SET_COUNTRY c
WHERE c.key = h.key;

 * postgresql://postgres:***@localhost:5455/furacaoDW
75242 rows affected.

[]

### Adicionar timezone para HURRICANE_RAW
Para criamos termos o campo horaLocal, de acordo com nossa constelação de fatos, tivemos que pegar o fuso horário pela latitude e longitude. 

Para isso, usamos a biblioteca geopandas e shapely.geometry para encontrar as timezones a partir da latitude e longitude. Criamos uma tabela SET_TIMEZONE e a preenchemos usando um csv com as timezones e suas respectivas chaves, de forma que fizemos um inner join entre essa tabela e a HURRICANE_RAW, adicionando as timezones.

In [191]:
import geopandas as gpd

# Load the shapefile
shapefile_path = "./World_Time_Zones-shp/World_Time_Zones.shp"
gdf = gpd.read_file(shapefile_path)

In [192]:
from shapely.geometry import Point

def get_timezone(coordinate_tuples):
    shapes = gdf['geometry'].values
    timezones = []

    for coordinate in coordinate_tuples:
        lat, lon = [coordinate[1], coordinate[2]]
        point = Point(lon, lat)

        fl_found = 0

        for idx, shape in enumerate(shapes):
            if(shape.contains(point)):
                timezone = gdf['ZONE'].values[idx]
                fl_found = 1
                break
        
        if fl_found == 0:
            timezone = round(lon/15)
            
        timezones.append((coordinate[0], timezone))

    return timezones

In [193]:
timezones = get_timezone(lat_long)

In [194]:
%%sql
DROP TABLE IF EXISTS SET_TIMEZONE;
CREATE TABLE SET_TIMEZONE (
    KEY INTEGER,
    TIMEZONE REAL
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

In [195]:
with open('set_timezone.csv', 'w', newline='') as file:
    writer = csv.writer(file)
    writer.writerows(timezones)

capture_command_output(f'sudo -S docker cp set_timezone.csv {CONTAINER_ID}:set_timezone.csv  < ./passwordfile')

[sudo] password for kibon:

''

In [196]:
%%sql
COPY SET_TIMEZONE(key, timezone)
FROM '/set_timezone.csv'
DELIMITER ',';

ALTER TABLE HURRICANE_RAW 
ADD COLUMN TIMEZONE REAL;

 * postgresql://postgres:***@localhost:5455/furacaoDW
75242 rows affected.
Done.

[]

In [197]:
%%sql
UPDATE HURRICANE_RAW h
SET timezone = t.timezone
FROM SET_TIMEZONE t
WHERE t.key = h.key;

 * postgresql://postgres:***@localhost:5455/furacaoDW

75242 rows affected.

[]

In [198]:
%%sql
ALTER TABLE HURRICANE_RAW 
ADD COLUMN LOCAL_TIME TIME;

UPDATE HURRICANE_RAW
SET LOCAL_TIME = TIME AT TIME ZONE 'UTC' + (TIMEZONE || ' hour')::interval::time;

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
75242 rows affected.

[]

### Adicionar categoria para HURRICANE_RAW 
Criamos o campo categoria, de acordo com nossa constelação de fatos. Para criá-lo, usamos o maxwind e a Escala de furacões de Saffir-Simpson. Para valores de maxwind menores que 64, a Escala de furacões de Saffir-Simpson não considera como um furacão, mas como uma tempestade ou depressão tropical. Por conta disso, nesses casos colocamos a categoria como -999.

In [199]:
%%sql
ALTER TABLE HURRICANE_RAW
ADD Categoria INTEGER;

UPDATE HURRICANE_RAW
SET Categoria = CASE
                    WHEN maxwind < 64 THEN -999
                    WHEN maxwind >= 64 AND  maxwind < 83 THEN 1 
                    WHEN maxwind >= 83 AND maxwind < 96 THEN 2
		            WHEN maxwind >= 96 AND maxwind < 113 THEN 3
		            WHEN maxwind >= 113 AND maxwind < 137 THEN 4
                    WHEN maxwind >= 137 THEN 5
                END;

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
75242 rows affected.

[]

### Observar valores de status do furacão
De acordo com a documentação do dataset, temos 9 opções de status de furacão. Entretanto, surgiram alguns outros status nos dados e resolvemos reclassificá-los para manter o padrão.

In [200]:
%%sql
SELECT DISTINCT(Status) FROM HURRICANE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaoDW
13 rows affected.

[(' DB',),
 (' ET',),
 (' EX',),
 (' HU',),
 (' HU ',),
 (' LO',),
 (' PT',),
 (' SD',),
 (' SS',),
 (' ST',),
 (' TD',),
 (' TS',),
 (' WV',)]

In [201]:
%%sql
DELETE FROM HURRICANE_RAW WHERE id = (SELECT DISTINCT id FROM HURRICANE_RAW WHERE status ~ 'PT');

UPDATE HURRICANE_RAW SET Status = TRIM(Status);

UPDATE HURRICANE_RAW SET Status = 'TS' WHERE Status = 'ST';
UPDATE HURRICANE_RAW SET Status = 'EX' WHERE Status = 'ET';

 * postgresql://postgres:***@localhost:5455/furacaoDW
28 rows affected.

75214 rows affected.
6 rows affected.
152 rows affected.

[]

### Adicionar status escrito
De acordo com nossa constelação de fatos, criamos o campo status escrito. Para isso, alteramos a sigla pela sua descrição, de acordo com a documentação do dataset.

In [202]:
%%sql
ALTER TABLE HURRICANE_RAW
ADD COLUMN written_status VARCHAR(200);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.

[]

In [203]:
%%sql
UPDATE HURRICANE_RAW h
SET written_status = s.written_status
FROM (SELECT DISTINCT status,
    CASE WHEN status = 'DB' THEN 'Disturbance'
    WHEN status = 'EX' THEN 'Extratropical cyclone'
    WHEN status = 'HU' THEN 'Tropical cyclone of hurricane intensity'
    WHEN status = 'LO' THEN 'Low'
    WHEN status = 'SD' THEN 'Subtropical cyclone of subtropical depression intensity'
    WHEN status = 'SS' THEN 'Subtropical cyclone of subtropical storm intensity'
    WHEN status = 'TD' THEN 'Tropical cyclone of tropical depression intensity'
    WHEN status = 'TS' THEN 'Tropical cyclone of tropical storm intensity'
    WHEN status = 'WV' THEN 'Tropical Wave'
END AS written_status
FROM HURRICANE_RAW) s
WHERE s.status = h.status;

 * postgresql://postgres:***@localhost:5455/furacaoDW
75214 rows affected.

[]

### Verificar valores nulos na tabela TEMPERATURE_RAW
Como não é permitido deixar valores nulos no data warehouse, mudamos os nulos para valores semânticos.

In [204]:
years = ['Y' + str(i) for i in range(1961, 2020)]
query = '''
UPDATE TEMPERATURE_RAW SET {year} = -999 WHERE {year} IS NULL;
'''

with engine.connect() as con:
    for year in years:
        rs = con.execute(text(query.format(year=year)))
        con.commit()

## Temperature

### Adicionar apenas países
O campo area na tabela TEMPERATURE_RAW possui mais do que apenas países, possuindo também estruturas, como a OCDE. Por conta disso, vamos comparar a area com o COUNTRY, que usamos na tabela HURRICANE_RAW, de forma que só pegamos os países.

In [205]:
capture_command_output(f'sudo -S docker cp countries.csv {CONTAINER_ID}:countries.csv < ./passwordfile')

[sudo] password for kibon:

''

In [206]:
%%sql
WITH SELECTED_COUNTRIES AS (
    SELECT DISTINCT COUNTRY
        FROM TEMPERATURE_RAW
            JOIN COUNTRIES ON LOWER(COUNTRY) = LOWER(AREA)
), UNSELECTED_COUNTRIES AS (
    SELECT DISTINCT AREA COUNTRY
        FROM TEMPERATURE_RAW
            LEFT JOIN SELECTED_COUNTRIES ON AREA = COUNTRY
    WHERE COUNTRY IS NULL
)
DELETE FROM TEMPERATURE_RAW temp 
    USING UNSELECTED_COUNTRIES unsel
WHERE temp.area = unsel.country;

 * postgresql://postgres:***@localhost:5455/furacaoDW
3162 rows affected.

[]

### Adicionar continente para Temperature e Hurricane
Conforme nossa constelação de dados, adicionamos o campo continente nas tabelas TEMPERATURE_RAW e HURRICANE_RAW. 

Para isso, criamos a coluna continente nessas 2 tabelas, pegamos os países de ambas tabelas e fazemos uma chamada de API que pega o continente a partir do país. Entretanto, alguns continentes não foram encontrados e seu valor na tabela é NOT FOUND. Depois, criamos duas tabelas SET_CONTINENT_T e SET_CONTINENT_H, para a temperatura e o furacão, e as preenchemos com o csv set_continente_t e set_continente_h, respectivamente. Depois, atualizamos as tabelas TEMPERATURE_RAW e HURRICANE_RAW com o nvo campo.

In [207]:
%%sql
ALTER TABLE TEMPERATURE_RAW
ADD COLUMN CONTINENT VARCHAR(100);

ALTER TABLE HURRICANE_RAW
ADD COLUMN CONTINENT VARCHAR(100);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

In [208]:
%%sql countries << 
SELECT DISTINCT
CASE
    WHEN area IS NULL AND country IS NOT NULL THEN country
    WHEN country IS NULL AND area IS NOT NULL THEN area
    WHEN country IS NOT NULL AND area IS NOT NULL THEN country
END AS FINAL_COUNTRY
FROM TEMPERATURE_RAW 
FULL OUTER JOIN HURRICANE_RAW 
    ON LOWER(TRIM(area)) = LOWER(TRIM(country));

 * postgresql://postgres:***@localhost:5455/furacaoDW

213 rows affected.
Returning data to local variable countries

In [209]:
countries = [country[0] for country in countries]

def country_to_continent(country_name):
    try:
        country_alpha2 = pc.country_name_to_country_alpha2(country_name)
        country_continent_code = pc.country_alpha2_to_continent_code(country_alpha2)
        country_continent_name = pc.convert_continent_code_to_continent_name(country_continent_code)
        return country_continent_name
    except:
        return 'NOT_FOUND'

continents = {country: country_to_continent(country) for country in countries}
continents

{'Solomon Islands': 'Oceania',
 'Eritrea': 'Africa',
 'Tuvalu': 'Oceania',
 'Brunei Darussalam': 'Asia',
 'Armenia': 'Asia',
 'El Salvador': 'North America',
 'Uganda': 'Africa',
 'Cuba': 'North America',
 'Angola': 'Africa',
 'Zambia': 'Africa',
 'Guam': 'Oceania',
 'Belgium': 'Europe',
 'Mali': 'Africa',
 'Seychelles': 'Africa',
 'Djibouti': 'Africa',
 'Cyprus': 'Asia',
 'Guernsey': 'Europe',
 'Albania': 'Europe',
 'Viet Nam': 'Asia',
 'American Samoa': 'Oceania',
 'Guadeloupe': 'North America',
 'Denmark': 'Europe',
 'Kuwait': 'Asia',
 'Namibia': 'Africa',
 'Jordan': 'Asia',
 'Uzbekistan': 'Asia',
 'Bhutan': 'Asia',
 'Western Sahara': 'NOT_FOUND',
 'Malaysia': 'Asia',
 'Iceland': 'Europe',
 'Turkey': 'Asia',
 'Mongolia': 'Asia',
 'Russian Federation': 'Europe',
 'Pakistan': 'Asia',
 'Panama': 'North America',
 'Guinea-Bissau': 'Africa',
 'Benin': 'Africa',
 'Dominica': 'North America',
 'Sierra Leone': 'Africa',
 'Saint Pierre and Miquelon': 'North America',
 'Burkina Faso': 'Africa',
 'Faroe Islands': 'Europe',
 'Bangladesh': 'Asia',
 'Algeria': 'Africa',
 'Serbia': 'Europe',
 'Philippines': 'Asia',
 'Saint Martin': 'North America',
 'Uruguay': 'South America',
 'Egypt': 'Africa',
 'Ethiopia': 'Africa',
 'Guyana': 'South America',
 'Aruba': 'North America',
 'Australia': 'Oceania',
 'Trinidad and Tobago': 'North America',
 'Saint Lucia': 'North America',
 'Liechtenstein': 'Europe',
 'Virgin Islands British': 'NOT_FOUND',
 'Malta': 'Europe',
 'Somalia': 'Africa',
 'Saudi Arabia': 'Asia',
 'Tajikistan': 'Asia',
 'United Arab Emirates': 'Asia',
 'Slovenia': 'Europe',
 'Samoa': 'Oceania',
 'Ukraine': 'Europe',
 'Latvia': 'Europe',
 'Tunisia': 'Africa',
 'Tokelau': 'Oceania',
 'Belarus': 'Europe',
 'Estonia': 'Europe',
 'San Marino': 'Europe',
 'Israel': 'Asia',
 'United States': 'North America',
 'Rwanda': 'Africa',
 'Central African Republic': 'Africa',
 'Andorra': 'Europe',
 'Nigeria': 'Africa',
 'Canada': 'North America',
 'Greece': 'Europe',
 'Palau': 'Oceania',
 'Syrian Arab Republic': 'Asia',
 'Suriname': 'South America',
 'Sudan': 'Africa',
 'Poland': 'Europe',
 'Thailand': 'Asia',
 'Cook Islands': 'Oceania',
 'Saint Kitts and Nevis': 'North America',
 'Jamaica': 'North America',
 'Montenegro': 'Europe',
 'Norfolk Island': 'Oceania',
 'Sri Lanka': 'Asia',
 'Costa Rica': 'North America',
 'Kenya': 'Africa',
 'Morocco': 'Africa',
 'Romania': 'Europe',
 'Tonga': 'Oceania',
 'Luxembourg': 'Europe',
 'Chile': 'South America',
 'Equatorial Guinea': 'Africa',
 'Comoros': 'Africa',
 'Bahrain': 'Asia',
 'Virgin Islands U.S.': 'NOT_FOUND',
 'New Caledonia': 'Oceania',
 'Kyrgyzstan': 'Asia',
 'Lithuania': 'Europe',
 'Barbados': 'North America',
 'Fiji': 'Oceania',
 'Martinique': 'North America',
 'Brazil': 'South America',
 'Indonesia': 'Asia',
 'Oman': 'Asia',
 'Bahamas': 'North America',
 'China': 'Asia',
 'Saint Vincent and the Grenadines': 'North America',
 'Lebanon': 'Asia',
 'Netherlands': 'Europe',
 'Spain': 'Europe',
 'Svalbard and Jan Mayen': 'Europe',
 'Honduras': 'North America',
 'Belize': 'North America',
 'Portugal': 'Europe',
 'Colombia': 'South America',
 'Grenada': 'North America',
 'Mauritius': 'Africa',
 'Cambodia': 'Asia',
 'Niue': 'Oceania',
 'Yemen': 'Asia',
 'Turks and Caicos Islands': 'North America',
 'Italy': 'Europe',
 'Switzerland': 'Europe',
 'Germany': 'Europe',
 'Myanmar': 'Asia',
 'France': 'Europe',
 'Bermuda': 'North America',
 'Saint Bartelemey': 'NOT_FOUND',
 'Antarctica': 'NOT_FOUND',
 'Paraguay': 'South America',
 'Micronesia Federated States of': 'NOT_FOUND',
 'Haiti': 'North America',
 'Mayotte': 'Africa',
 'Monaco': 'Europe',
 'Ghana': 'Africa',
 'Mauritania': 'Africa',
 'Qatar': 'Asia',
 'Chad': 'Africa',
 'Peru': 'South America',
 'Iraq': 'Asia',
 'New Zealand': 'Oceania',
 'Austria': 'Europe',
 'Greenland': 'North America',
 'Curacao': 'NOT_FOUND',
 'Bulgaria': 'Europe',
 'Burundi': 'Africa',
 'Nicaragua': 'North America',
 'Antigua and Barbuda': 'North America',
 'Guinea': 'Africa',
 'United Kingdom': 'Europe',
 'Kiribati': 'Oceania',
 'Northern Mariana Islands': 'Oceania',
 'Ireland': 'Europe',
 'Montserrat': 'North America',
 'Marshall Islands': 'Oceania',
 'Guatemala': 'North America',
 'Cayman Islands': 'North America',
 'Senegal': 'Africa',
 'Argentina': 'South America',
 'India': 'Asia',
 'Nepal': 'Asia',
 'Maldives': 'Asia',
 'French Guiana': 'South America',
 'Cameroon': 'Africa',
 'Malawi': 'Africa',
 'Mozambique': 'Africa',
 'Niger': 'Africa',
 'Zimbabwe': 'Africa',
 'Cape Verde': 'Africa',
 'Vanuatu': 'Oceania',
 'Japan': 'Asia',
 'Lesotho': 'Africa',
 'Dominican Republic': 'North America',
 'Anguilla': 'North America',
 'Sint Maarten': 'NOT_FOUND',
 'Hungary': 'Europe',
 'Slovakia': 'Europe',
 'Togo': 'Africa',
 'Gambia': 'Africa',
 'Gibraltar': 'Europe',
 'Falkland Islands (Malvinas)': 'South America',
 'Gabon': 'Africa',
 'South Africa': 'Africa',
 'Papua New Guinea': 'Oceania',
 'Nauru': 'Oceania',
 'Venezuela': 'South America',
 'Bonaire Saint Eustatius and Saba': 'NOT_FOUND',
 'Croatia': 'Europe',
 'Congo': 'Africa',
 'Christmas Island': 'Asia',
 'Cocos (Keeling) Islands': 'Asia',
 'Botswana': 'Africa',
 'Puerto Rico': 'North America',
 'Azerbaijan': 'Asia',
 'French Polynesia': 'Oceania',
 'Norway': 'Europe',
 'Madagascar': 'Africa',
 'Sweden': 'Europe',
 'Ecuador': 'South America',
 'Mexico': 'North America',
 'Turkmenistan': 'Asia',
 'Singapore': 'Asia',
 'Finland': 'Europe',
 'Liberia': 'Africa',
 'Georgia': 'Asia',
 'Afghanistan': 'Asia'}

In [210]:
%sql countries_t << SELECT key, area FROM TEMPERATURE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaoDW
6494 rows affected.
Returning data to local variable countries_t

In [211]:
%sql countries_h << SELECT key, country FROM HURRICANE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaoDW
75214 rows affected.
Returning data to local variable countries_h

In [212]:
continents_t = [(country[0], continents[country[1]]) for country in countries_t]
continents_h = [(country[0], continents[country[1]]) for country in countries_h]

In [213]:
with open('set_continent_t.csv', 'w', newline='') as file:
    writer = csv.writer(file)
    writer.writerows(continents_t)

with open('set_continent_h.csv', 'w', newline='') as file:
    writer = csv.writer(file)
    writer.writerows(continents_h)

capture_command_output(f'sudo -S docker cp set_continent_h.csv {CONTAINER_ID}:set_continent_h.csv  < ./passwordfile')
capture_command_output(f'sudo -S docker cp set_continent_t.csv {CONTAINER_ID}:set_continent_t.csv  < ./passwordfile')

[sudo] password for kibon: [sudo] password for kibon:

''

In [214]:
%%sql
DROP TABLE IF EXISTS SET_CONTINENT_T;
CREATE TABLE SET_CONTINENT_T (
    KEY INTEGER,
    CONTINENT VARCHAR(100)
);

DROP TABLE IF EXISTS SET_CONTINENT_H;
CREATE TABLE SET_CONTINENT_H (
    KEY INTEGER,
    CONTINENT VARCHAR(100)
);

COPY SET_CONTINENT_T(key, continent)
FROM '/set_continent_t.csv'
DELIMITER ',';

COPY SET_CONTINENT_H(key, continent)
FROM '/set_continent_h.csv'
DELIMITER ',';

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.
Done.
Done.
6494 rows affected.
75214 rows affected.

[]

In [215]:
%%sql
UPDATE TEMPERATURE_RAW t
SET continent = c.continent
FROM SET_CONTINENT_T c
WHERE t.key = c.key;

UPDATE HURRICANE_RAW h
SET continent = c.continent
FROM SET_CONTINENT_H c
WHERE h.key = c.key;

 * postgresql://postgres:***@localhost:5455/furacaoDW
6494 rows affected.
75214 rows affected.

[]

### Apenas meses válidos e adicionar número do mês
Nos dados tinhamos meses que estavam 'January-March', como eles iriam atrapalhar ao realizar a consulta, pagamos esses casos. Além disso, de acordo com a constelação de fatos, criamos o campo do número do mês.

In [216]:
%%sql
ALTER TABLE TEMPERATURE_RAW
ADD COLUMN month_value INTEGER;

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.

[]

In [217]:
%%sql
WITH NOT_MONTHS AS (
SELECT DISTINCT MONTHS FROM TEMPERATURE_RAW t
  LEFT JOIN MONTHS AS m ON t.months = m.month
      WHERE m.month IS NULL)
DELETE FROM TEMPERATURE_RAW temp 
    USING NOT_MONTHS nm
WHERE nm.months = temp.months;

UPDATE TEMPERATURE_RAW t
SET month_value = m.value
FROM MONTHS m
WHERE t.months = m.month;

 * postgresql://postgres:***@localhost:5455/furacaoDW
1910 rows affected.
4584 rows affected.

[]

# Load

## Criando tabelas reais
De acordo com a constelação de fatos, criamos as tabelas reais que vamos usar para fazer as consultas.

#### Tabela Localização

In [218]:
%%sql
DROP TABLE IF EXISTS LOCALIZACAO;
CREATE TABLE LOCALIZACAO (
    CHAVE_LOCALIZACAO SERIAL NOT NULL,
    PAIS VARCHAR(100),
    CONTINENTE VARCHAR(100),
    CONSTRAINT PK_LOCALIZACAO PRIMARY KEY (CHAVE_LOCALIZACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

### Esquema Estrela Furacão

#### Tabela Furacao

In [219]:
%%sql
DROP TABLE IF EXISTS FURACAO;
CREATE TABLE FURACAO (
    CHAVE_DATA_FURACAO SERIAL NOT NULL,
    CHAVE_HORARIO SERIAL NOT NULL,
    CHAVE_STATUS SERIAL NOT NULL,
    CHAVE_IDENTIFICACAO SERIAL NOT NULL,
    CHAVE_LOCALIZACAO SERIAL NOT NULL,
    VELOCIDADE_DO_VENTO INTEGER,
    CATEGORIA VARCHAR(100),
    QUANT_OCORRENCIA INTEGER,
    CONSTRAINT PK_FURACAO PRIMARY KEY (CHAVE_DATA_FURACAO, CHAVE_HORARIO, CHAVE_STATUS, CHAVE_IDENTIFICACAO, CHAVE_LOCALIZACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

#### Tabela Data_Furacao

In [220]:
%%sql
DROP TABLE IF EXISTS DATA_FURACAO;
CREATE TABLE DATA_FURACAO (
    CHAVE_DATA_FURACAO SERIAL NOT NULL,
    DIA INTEGER,
    MES INTEGER,
    MES_ESCRITO VARCHAR(100),
    TRIMESTRE INTEGER,
    SEMESTRE INTEGER,
    ANO INTEGER,
    CONSTRAINT PK_DATA_FURACAO PRIMARY KEY (CHAVE_DATA_FURACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

#### Tabela Horario

In [221]:
%%sql
DROP TABLE IF EXISTS HORARIO;
CREATE TABLE HORARIO (
    CHAVE_HORARIO SERIAL NOT NULL,
    HORA_UTC TIME,
    HORA_LOCAL TIME,
    CONSTRAINT PK_HORARIO PRIMARY KEY (CHAVE_HORARIO)
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

#### Tabela Status

In [222]:
%%sql
DROP TABLE IF EXISTS STATUS;
CREATE TABLE STATUS (
    CHAVE_STATUS SERIAL NOT NULL,
    STATUS VARCHAR(5),
    STATUS_ESCRITO VARCHAR(100),
    CONSTRAINT PK_STATUS PRIMARY KEY (CHAVE_STATUS)
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

#### Tabela Identificacao

In [223]:
%%sql
DROP TABLE IF EXISTS IDENTIFICACAO;
CREATE TABLE IDENTIFICACAO (
    CHAVE_IDENTIFICACAO SERIAL NOT NULL,
    ID VARCHAR(100),
    NOME VARCHAR(100),
    CONSTRAINT PK_IDENTIFICACAO PRIMARY KEY (CHAVE_IDENTIFICACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

### Esquema Estrela Aquecimento

#### Tabela Aquecimento

In [273]:
%%sql
DROP TABLE IF EXISTS AQUECIMENTO;
CREATE TABLE AQUECIMENTO (
    CHAVE_DATA_AQUECIMENTO SERIAL NOT NULL,
    CHAVE_LOCALIZACAO SERIAL NOT NULL,
    DESVIO_PADRAO REAL,
    VARIACAO_TEMPERATURA REAL,
    CONSTRAINT PK_AQUECIMENTO PRIMARY KEY (CHAVE_DATA_AQUECIMENTO, CHAVE_LOCALIZACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

#### Tabela Data_Aquecimento

In [260]:
%%sql
DROP TABLE IF EXISTS DATA_AQUECIMENTO;
CREATE TABLE DATA_AQUECIMENTO (
    CHAVE_DATA_AQUECIMENTO SERIAL NOT NULL,
    MES INTEGER,
    MES_ESCRITO VARCHAR(100),
    TRIMESTRE INTEGER,
    SEMESTRE INTEGER,
    ANO INTEGER,
    CONSTRAINT PK_DATA_AQUECIMENTO PRIMARY KEY (CHAVE_DATA_AQUECIMENTO)
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

## Carregando Dados

#### Alterar formato da tabela TEMPERATURE_RAW 
A tabela TEPERATURE_RAW não está num bom formato para carregar os dados nas tabelas reais, pois temos 2 linhas para o mesmo mês e o mesmo furacão em que apenas o elemento é mudado, sendo ele temperatura ou desvio padrão. Além disso, cada ano está como uma coluna diferente, o que dificulta bastante. Assim, criamos a tabela TEMPERATURE_SEMI para facilitar a conversão para as tabelas reais. Logo, para cada tupla temos apenas um ano e um elemento, por exemplo.

In [226]:
%%sql
SELECT * FROM TEMPERATURE_RAW LIMIT 5;

 * postgresql://postgres:***@localhost:5455/furacaoDW
5 rows affected.

[(104, 5, 'American Samoa', 7001, 'January', 6078, 'Standard Deviation', 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, -999.0, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 0.429, 'Oceania', 1),
 (103, 5, 'American Samoa', 7001, 'January', 7271, 'Temperature change', 0.565, -0.23, -0.066, 0.222, -0.836, 0.137, -0.099, 0.068, 0.315, 0.0, -0.511, -0.799, 0.395, -0.264, -0.206, -0.761, 0.616, 0.076, -0.05, 0.218, 0.556, 0.285, 0.553, -0.02, -0.319, 0.215, 0.479, 0.821, -0.557, 0.463, 0.539, 0.573, 0.463, 0.674, 0.529, 0.626, 0.583, -999.0, 0.078, 1.174, 1.32, 1.277, 1.779, 0.276, 1.617, 0.054, 1.145, 0.689, 1.468, 3.01, 0.379, 0.843, 0.534, 0.553, 0.993, 1.863, 1.713, 0.763, 1.513, 'Oceania', 1),
 (106, 5, 'American Samoa', 7002, 'February', 6078, 'Standard Deviation', 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, -999.0, 0.488, 0.488, 0.488, -999.0, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 0.488, 'Oceania', 2),
 (105, 5, 'American Samoa', 7002, 'February', 7271, 'Temperature change', 0.261, -0.105, 0.132, 0.294, -0.859, 0.559, -0.459, -0.463, 0.133, 0.275, -0.614, -0.369, 0.617, -0.735, 0.016, -0.594, 0.865, 0.368, 0.227, 0.514, -0.103, -0.119, 1.191, 0.42, 0.328, 0.351, 0.927, 0.88, -0.262, 0.5, 0.696, 0.746, 0.596, -999.0, 0.672, 0.697, 1.281, -999.0, 0.14, 1.04, 1.271, 1.911, 1.016, 0.276, 1.658, 0.465, 1.539, 1.437, 1.69, 1.015, -0.098, 0.702, 1.182, 1.466, 1.526, 2.606, 0.806, 0.956, 1.506, 'Oceania', 2),
 (138, 6, 'Andorra', 7001, 'January', 6078, 'Standard Deviation', 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 1.27, 'Europe', 1)]

In [227]:
%%sql
DROP TABLE IF EXISTS TEMPERATURE_SEMI;
CREATE TABLE TEMPERATURE_SEMI (
    area VARCHAR(200),
    continent VARCHAR(100),
    month_value INTEGER,
    months VARCHAR(100),
    year INTEGER,
    temp_change REAL,
    std_dev REAL
);

 * postgresql://postgres:***@localhost:5455/furacaoDW
Done.
Done.

[]

In [228]:
%sql countries << SELECT DISTINCT area FROM TEMPERATURE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaoDW
191 rows affected.
Returning data to local variable countries

In [229]:
countries = [country[0] for country in countries]
month_values = list(range(1, 13))
years = ['Y' + str(i) for i in range(1961, 2020)]

In [232]:
query_tmp = '''
SELECT area, continent, month_value, months, {year_int} as Year, {year} as temp_change
FROM TEMPERATURE_RAW
WHERE element = 'Temperature change' AND area = '{country}' AND month_value={month_value};
'''
query_std = '''
SELECT {year} as std_dev
FROM TEMPERATURE_RAW
WHERE element = 'Standard Deviation' AND area = '{country}' AND month_value={month_value};
'''

insert_query = '''
INSERT INTO TEMPERATURE_SEMI (area, continent, month_value, months, year, temp_change, std_dev)
VALUES {values};
'''

with engine.connect() as con:
    for country in countries:
        for month in month_values:
            for year in years:
                if "'" in country:
                    country = country.replace("'", '\'')
                rs_temp = con.execute(text(query_tmp.format(year=year, year_int=int(year[1:]), country=country, month_value=month)))
                rs_std = con.execute(text(query_std.format(year=year, country=country, month_value=month)))
                
                rs_final = [list(result) for result in rs_temp][0]
                rs_std = [rs for rs in rs_std]
                rs_final.append(rs_std[0][0])

                con.execute(text(insert_query.format(values=tuple(rs_final))))
                
                con.commit()

In [244]:
%%sql
SELECT * FROM TEMPERATURE_SEMI LIMIT 5;

 * postgresql://postgres:***@localhost:5455/furacaoDW
5 rows affected.

[('Bangladesh', 'Asia', 1, 'January', 1961, 0.928, 0.59),
 ('Bangladesh', 'Asia', 1, 'January', 1962, -1.171, 0.59),
 ('Bangladesh', 'Asia', 1, 'January', 1963, -0.318, 0.59),
 ('Bangladesh', 'Asia', 1, 'January', 1964, -0.268, 0.59),
 ('Bangladesh', 'Asia', 1, 'January', 1965, 0.396, 0.59)]

#### Tabela Localização
Carregamos os dados para a tabela LOCALIZACAO

In [233]:
%%sql
INSERT INTO LOCALIZACAO (pais, continente)
SELECT DISTINCT country, continent FROM
HURRICANE_RAW;

MERGE INTO LOCALIZACAO l USING (SELECT DISTINCT area, continent FROM TEMPERATURE_RAW) t ON l.pais = t.area AND l.continente = t.continent
WHEN NOT MATCHED THEN
INSERT (pais, continente) VALUES (t.area, t.continent);

 * postgresql://postgres:***@localhost:5455/furacaoDW
77 rows affected.
136 rows affected.

[]

#### Tabela Horario
Carregamos os dados para a tabela HORARIO

In [234]:
%%sql
INSERT INTO HORARIO (hora_utc, hora_local)
SELECT DISTINCT time, local_time
FROM HURRICANE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaoDW
279 rows affected.

[]

#### Tabela Identificacao
Carregamos os dados para a tabela IDENTIFICACAO

In [235]:
%%sql
INSERT INTO IDENTIFICACAO (id, nome)
SELECT DISTINCT id, name
FROM HURRICANE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaoDW
2863 rows affected.

[]

#### Tabela Status
Carregamos os dados para a tabela Status

In [236]:
%%sql
INSERT INTO Status (status, status_escrito)
SELECT DISTINCT status, written_status FROM
HURRICANE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaoDW
9 rows affected.

[]

#### Tabela Data_Furacao
Carregamos os dados para a tabela Data_Furacao

In [237]:
%%sql
INSERT INTO Data_Furacao (dia, mes, mes_escrito, trimestre, semestre, ano)
SELECT DISTINCT EXTRACT(DAY FROM date), EXTRACT(MONTH FROM date), written_month, EXTRACT(QUARTER FROM date), (EXTRACT(QUARTER FROM date)/2), EXTRACT(YEAR FROM date)
FROM HURRICANE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaoDW
12828 rows affected.

[]

#### Tabela Data_Aquecimento
Carregamos os dados para a tabela Data_Aquecimento

In [263]:
%%sql
INSERT INTO Data_Aquecimento (mes, mes_escrito, trimestre, semestre, ano)
SELECT DISTINCT month_value, months, (month_value-1)/3 + 1, (month_value-1)/6 + 1, year
FROM TEMPERATURE_SEMI;

 * postgresql://postgres:***@localhost:5455/furacaoDW
708 rows affected.

[]

#### Tabela Aquecimento
Carregamos os dados para a tabela de fatos Aquecimento

In [274]:
%%sql
INSERT INTO Aquecimento (chave_data_aquecimento, chave_localizacao, desvio_padrao, variacao_temperatura)
SELECT d.chave_data_aquecimento, l.chave_localizacao, t.std_dev, t.temp_change
FROM DATA_AQUECIMENTO d JOIN TEMPERATURE_SEMI t ON d.mes = t.month_value AND d.ano = t.year
    JOIN LOCALIZACAO l ON t.area = l.pais
WHERE t.std_dev != -999 AND t.temp_change != -999;

 * postgresql://postgres:***@localhost:5455/furacaoDW
111627 rows affected.

[]

In [2]:
%%sql
SELECT * FROM Aquecimento LIMIT 5;

 * postgresql://postgres:***@localhost:5455/furacaoDW
15 rows affected.

[(39, 81, 0.59, 0.928),
 (95, 81, 0.59, -1.171),
 (643, 81, 0.59, -0.318),
 (80, 81, 0.59, -0.268),
 (497, 81, 0.59, 0.396),
 (40, 81, 0.59, 0.44),
 (137, 81, 0.59, 0.441),
 (689, 81, 0.59, -0.293),
 (606, 81, 0.59, -0.52),
 (314, 81, 0.59, -0.335),
 (675, 81, 0.59, 0.095),
 (676, 81, 0.59, 0.517),
 (217, 81, 0.59, 0.638),
 (129, 81, 0.59, -0.387),
 (328, 81, 0.59, -0.145)]

#### Tabela Furacao
Carregamos os dados para a tabela de fatos Furacao

In [241]:
%%sql
INSERT INTO Furacao (chave_data_furacao, chave_horario, chave_status, 
                    chave_identificacao, chave_localizacao, velocidade_do_vento,
                    categoria, quant_ocorrencia)
SELECT d.chave_data_furacao, hr.chave_horario, s.chave_status, i.chave_identificacao, l.chave_localizacao, h.maxwind, h.categoria, 1
FROM HURRICANE_RAW h
JOIN Data_Furacao d 
    ON EXTRACT(DAY FROM h.date) = d.dia AND EXTRACT(MONTH FROM h.date) = d.mes AND EXTRACT(YEAR FROM h.date) = d.ano
JOIN Horario hr
    ON hr.hora_utc = h.time AND hr.hora_local = h.local_time
JOIN Status s
    ON s.status = h.status
JOIN Identificacao i
    ON i.id = h.id
JOIN Localizacao l
    ON l.pais = h.country;

 * postgresql://postgres:***@localhost:5455/furacaoDW

75214 rows affected.

[]

In [243]:
%%sql
SELECT * FROM Furacao LIMIT 5;

 * postgresql://postgres:***@localhost:5455/furacaoDW
4 rows affected.

[(11553, 252, 1, 94, 45, 40, '-999', 1),
 (11553, 98, 1, 94, 45, 40, '-999', 1),
 (640, 149, 4, 2072, 27, 70, '1', 1),
 (640, 71, 4, 2072, 27, 70, '1', 1)]